#include <inttypes.h>
#include <stdbool.h>
#include <stdio.h>
#include <stdlib.h>

/*
Количество четных чисел
Дана последовательность ненулевых целых чисел, в конце последовательности число 0. Посчитать количество четных чисел.

Формат входных данных
Последовательность ненулевых целых чисел. В конце последовательности число ноль.
Формат результата
Одно целое число - количество четных чисел.
Примеры
Входные данные
15 22 2 4 1 6 0
Результат работы
4
Входные данные
27 1 3 7 0
Результат работы
0
*/

int main(int argc, char* argv[])
{
    uint32_t    n = 0,
                i = 0;
    
    // printf("Input a sequence of integers >= 0, ends with 0: ");

    do
    {
        scanf("%" SCNu32, &n);
        if (n && !(n & 1U))
            ++i;
    } while (n);
    
    printf("%" PRIu32 "\n", i);

    return EXIT_SUCCESS;
}