#include <inttypes.h>
#include <stdio.h>
#include <stdlib.h>

/*
Сколько раз встречается символ a
Дана строка из английских символов, пробелов и знаков препинания. В конце строки символ точка. Необходимо реализовать рекурсивную функцию, которая считывает данную строку со стандартного потока ввода и возвращает целое число - количество символов 'a' в данной строке.
int acounter(void)
Используя данную функцию решить задачу.

Формат входных данных
Строка состоящая из английских букв, пробелов и знаков препинания. В коне строки символ '.'
Формат результата
Одно целое число.
Примеры
Входные данные
abcd a.
Результат работы
2
Входные данные
Hello world.
Результат работы
0
*/

uint32_t acounter(void);

int main(int argc, char* argv[])
{
    (void)argc;
    (void)argv;

    printf("%" PRIu32, acounter());
    
    return EXIT_SUCCESS;
}

uint32_t acounter(void)
{
    char c = (char)getchar();

    if (c =='.')
        return 0;    

    return (c == 'a' ? 1 : 0) + acounter();
}
