#include <inttypes.h>
#include <math.h>
#include <stdio.h>
#include <stdlib.h>

/*
Сколько зерен на доске
Когда создатель шахмат, древнеиндийский мудрец и математик Сисса бен Дахир, показал своё изобретение Правителю страны, тому так понравилась игра, что он позволил изобретателю право самому выбрать награду. Мудрец попросил у Повелителя за первую клетку шахматной доски заплатить ему одно зерно риса, за второе — два, за третье — четыре и т. д., удваивая количество зёрен на каждой следующей клетке. Помоги повелителю сосчитать сколько зерен на какой клетке лежит.
Необходимо составить функцию, которая определяет, сколько зерен попросил положить на N-ую клетку изобретатель шахмат (на 1-ую – 1 зерно, на 2-ую – 2 зерна, на 3-ю – 4 зерна, …)

Формат входных данных
Цлое число от 1 до 64
Формат результата
Одно целое число. Количество зерен на данной клетке.
Примеры
Входные данные
3
Результат работы
4
Входные данные
28
Результат работы
134217728
*/

long double geometry_progression_n(double b1, uint32_t n, double q);

int main(int argc, char* argv[])
{
    (void)argc;
    (void)argv;
    
    uint8_t n = 0;

    scanf("%" SCNu8, &n);

    if (n < 1 || n > 64)
        return EXIT_FAILURE;

    printf("%llu", (uint64_t)geometry_progression_n(1, n, 2));
    
    return EXIT_SUCCESS;
}

long double geometry_progression_n(double b1, uint32_t n, double q)
{
    long double result = 0;
    
    if (n == 0)
        return result;
    
    result = b1 * powl(q, n - 1);
    return result; 
}